In [1]:
import numpy as np
import pandas as pd

In [3]:
frame = pd.read_csv('examples/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
frame.to_pickle('examples/frame_pickle')

In [7]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [9]:
store = pd.HDFStore('examples/mydata.h5')

In [10]:
store['obj1'] = frame

In [11]:
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: examples/mydata.h5

In [12]:
store['obj1']

           a
0   0.393313
1  -0.109037
2   0.749630
3  -0.749743
4   0.697893
..       ...
95 -1.720990
96  0.987971
97  1.623249
98 -0.054786
99 -0.072884

[100 rows x 1 columns]

In [13]:
store.put('obj2', frame, format='table')

In [14]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -1.649766
11  0.143407
12 -1.797421
13 -1.506150
14  0.729632
15 -1.006468

In [15]:
store.close()

In [16]:
frame.to_hdf('examples/mydata1.h5', 'obj3', format='table')

In [17]:
pd.read_hdf('examples/mydata1.h5', 'obj3', where=['index < 5'])

          a
0  0.393313
1 -0.109037
2  0.749630
3 -0.749743
4  0.697893

In [18]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [19]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [21]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [22]:
frame.to_excel(writer, 'Sheet1')

In [24]:
writer.save()

In [25]:
frame.to_excel('examples/ex2.xlsx')

In [26]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [27]:
writer